src/BusinessProcesses/КонтрольТрудозатрат/КонтрольТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>КонтрольТрудозатрат</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцессИсточник</name>
    <comment>Процесс, породивший данный бизнес-процесс</comment>
    <type>
      <types>BusinessProcessRef.СогласованиеПереноса</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/InformationRegisters/ОценкаТрудозатратПоЗадачам/ОценкаТрудозатратПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаТрудозатратПоЗадачам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольИсполнителяЗадачи</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/BusinessProcesses/КонтрольТрудозатрат/ObjectModule.bsl
#Область ОбработчикиСобытийКартыМаршрута

Процедура ЕстьПревышениеОценкиТрудозатратПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	// Проверка превышения суммарной оценки и суммарных трудозатрат 
	ЧасыПоЗадаче = Справочники.ЗадачиМетеор.ПолучитьЧасыПоЗадачеМетеор(ЗадачаМетеор);
	Если Не ЧасыПоЗадаче.Количество() Тогда
		Результат = Ложь;
		Возврат;
	КонецЕсли;

	ЧасыПоЗадаче.Свернуть(, "Затрачено");
	ВсегоЗатрачено = ЧасыПоЗадаче[0].Затрачено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗадачаМетеор", ЗадачаМетеор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ОценкаТрудозатратПоЗадачам.Количество), 0) КАК Количество,
		|	МаксимальныйПроцентПревышенияОценкиКонтроляТрудозатрат.Значение КАК МаксимальныйПроцентПревышенияОценкиКонтроля
		|ИЗ
		|	РегистрСведений.ОценкаТрудозатратПоЗадачам КАК ОценкаТрудозатратПоЗадачам,
		|	Константа.МаксимальныйПроцентПревышенияОценкиКонтроляТрудозатрат КАК МаксимальныйПроцентПревышенияОценкиКонтроляТрудозатрат
		|ГДЕ
		|	ОценкаТрудозатратПоЗадачам.ЗадачаМетеор = &ЗадачаМетеор
		|
		|СГРУППИРОВАТЬ ПО
		|	МаксимальныйПроцентПревышенияОценкиКонтроляТрудозатрат.Значение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		// Не найдены оценки. Предположительно, программное движение процесса. Значит пропускаем шаг согласования.
		Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	ПроцентПревышения = (ВсегоЗатрачено - Выборка.Количество) / Выборка.Количество * 100;
	Результат = ПроцентПревышения >= Выборка.МаксимальныйПроцентПревышенияОценкиКонтроля;	
	
КонецПроцедуры

Процедура ОценкаТрудозатратРазработкиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗаполнитьКомментарийЗадачиИзНаименования(ФормируемыеЗадачи);
КонецПроцедуры

Процедура ОценкаТрудозатратАналитикиПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ЗаполнитьКомментарийЗадачиИзНаименования(ФормируемыеЗадачи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМодуля

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКомментарийЗадачиИзНаименования(ФормируемыеЗадачи)
	// Для отображения в списке в обработке "Согласование заявок"
	Для Каждого ФормируемаяЗадача Из ФормируемыеЗадачи Цикл
		ФормируемаяЗадача.Комментарий = ФормируемаяЗадача.Наименование;		
	КонецЦикла;
КонецПроцедуры


#КонецОбласти
